#### Pandas
- Series
- DataFrame
- Panel

In [1]:
import pandas as pd
pd.__version__

'0.23.4'

Series
- from list,tuple,dictionary
- from numpy array

In [2]:
import numpy as np

In [3]:
np.array([1,2,3])

array([1, 2, 3])

In [4]:
s = pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [5]:
s1 = pd.Series([1,2,3],index=['I','II','III'])
s1

I      1
II     2
III    3
dtype: int64

In [6]:
print(s[0])
print(s1[0],s1['I'])

1
1 1

In [7]:
print(s1[0:2])

I     1
II    2
dtype: int64

In [8]:
s1['I':'III']

I      1
II     2
III    3
dtype: int64

In [9]:
s.index = ['i1','i2','i3']

In [10]:
s

i1    1
i2    2
i3    3
dtype: int64

In [11]:
marks = {'maths':67,'science':78,'english':56}
marks

{'maths': 67, 'science': 78, 'english': 56}

In [12]:
pd.Series(marks)

maths      67
science    78
english    56
dtype: int64

In [13]:
pd.date_range('2019-11-23','2019-11-30')

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27', '2019-11-28', '2019-11-29', '2019-11-30'],
              dtype='datetime64[ns]', freq='D')

In [14]:
pd.date_range('2019-11-23',periods=5)

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26',
               '2019-11-27'],
              dtype='datetime64[ns]', freq='D')

In [15]:
temp = pd.Series([32,29,30,31],\
                 pd.date_range('2019-11-23',periods=4))

In [16]:
temp

2019-11-23    32
2019-11-24    29
2019-11-25    30
2019-11-26    31
Freq: D, dtype: int64

In [17]:
temp['2019-11-23 ']

32

In [18]:
temp.index

DatetimeIndex(['2019-11-23', '2019-11-24', '2019-11-25', '2019-11-26'], dtype='datetime64[ns]', freq='D')

In [19]:
s.index

Index(['i1', 'i2', 'i3'], dtype='object')

In [20]:
s1.index

Index(['I', 'II', 'III'], dtype='object')

In [21]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

DataFrame
- From a Dictionary
- From numpy 2d array

In [22]:
studentmarks = {"Name":['Ram','Asha','Giri'],
                "Maths":[23,45,67],
                "Science":[57,78,65],
                "English":[35,66,47]}
studentmarks

{'Name': ['Ram', 'Asha', 'Giri'],
 'Maths': [23, 45, 67],
 'Science': [57, 78, 65],
 'English': [35, 66, 47]}

In [23]:
pd.DataFrame(studentmarks)

   Name  Maths  Science  English
0   Ram     23       57       35
1  Asha     45       78       66
2  Giri     67       65       47

In [24]:
a2 = np.array([['Ram',23,57,35],['Asha',45,78,66]])
pd.DataFrame(a2,columns=['Name','Maths','Science','English'])

   Name Maths Science English
0   Ram    23      57      35
1  Asha    45      78      66

In [25]:
pd.DataFrame(a2,columns=['Name','Maths','Science','English'],
            index = ['std1','std2'])

      Name Maths Science English
std1   Ram    23      57      35
std2  Asha    45      78      66

##### pd.read_csv()

In [26]:
pd.read_csv('marks.csv')

         'Ram'  23    57  35
0       'Asha'  45   NaN  66
1       'Roja'  56  55.0  45
2       'Ravi'  77  89.0  67
3       'Suma'  90  56.0  37
4      'Rohan'  67  82.0  29
5      'Raman'  39  78.0  34
6      'Basha'  65  34.0  78
7  'Charishma'  56  78.0  34
8      'Krish'  72  34.0  78

In [27]:
pd.read_csv('marks.csv',header=None)

             0   1     2   3
0        'Ram'  23  57.0  35
1       'Asha'  45   NaN  66
2       'Roja'  56  55.0  45
3       'Ravi'  77  89.0  67
4       'Suma'  90  56.0  37
5      'Rohan'  67  82.0  29
6      'Raman'  39  78.0  34
7      'Basha'  65  34.0  78
8  'Charishma'  56  78.0  34
9      'Krish'  72  34.0  78

In [28]:
pd.read_csv('marks.csv',header=1)

        'Asha'  45  Unnamed: 2  66
0       'Roja'  56          55  45
1       'Ravi'  77          89  67
2       'Suma'  90          56  37
3      'Rohan'  67          82  29
4      'Raman'  39          78  34
5      'Basha'  65          34  78
6  'Charishma'  56          78  34
7      'Krish'  72          34  78

In [29]:
pd.read_csv('marks.csv',\
            names=['Name','Maths','Science','English'],
           usecols= ['Name','English','Science'])

          Name  Science  English
0        'Ram'     57.0       35
1       'Asha'      NaN       66
2       'Roja'     55.0       45
3       'Ravi'     89.0       67
4       'Suma'     56.0       37
5      'Rohan'     82.0       29
6      'Raman'     78.0       34
7      'Basha'     34.0       78
8  'Charishma'     78.0       34
9      'Krish'     34.0       78

In [30]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, skipfooter=0, doublequote=True, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None)
    Read CSV (comma-separated) file into DataFrame

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the `online docs for IO Tools
    <http://pandas.pydata.org/pandas-docs/stable/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, pathlib.Path, py._path.local.LocalPath or any \
    object with a read() method (such as a file handle or StringIO)
        The string could be a URL. Valid URL schemes include http, ftp, s3, and
        file. For file URLs, a host is expected. For instance, a local file could
        be file://localhost/path/to/table.csv
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``
    delimiter : str, default ``None``
        Alternative argument name for sep.
    delim_whitespace : boolean, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'\t'``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    header : int or list of ints, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so header=0 denotes the first line of
        data rather than the first line of the file.
    names : array-like, default None
        List of column names to use. If file contains no header row, then you
        should explicitly pass header=None. Duplicates in this list will cause
        a ``UserWarning`` to be issued.
    index_col : int or sequence or False, default None
        Column to use as the row labels of the DataFrame. If a sequence is given, a
        MultiIndex is used. If you have a malformed file with delimiters at the end
        of each line, you might consider index_col=False to force pandas to _not_
        use the first column as the index (row names)
    usecols : list-like or callable, default None
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid list-like
        `usecols` parameter would be [0, 1, 2] or ['foo', 'bar', 'baz']. Element
        order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : boolean, default False
        If the parsed data only contains one column then return a Series
    prefix : str, default None
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : boolean, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels
    true_values : list, default None
        Values to consider as True
    false_values : list, default None
        Values to consider as False
    skipinitialspace : boolean, default False
        Skip spaces after delimiter.
    skiprows : list-like or integer or callable, default None
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c')
    nrows : int, default None
        Number of rows of file to read. Useful for reading pieces of large files
    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : boolean, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file
    verbose : boolean, default False
        Indicate number of NA values placed in non-numeric columns
    skip_blank_lines : boolean, default True
        If True, skip over blank lines rather than interpreting as NaN values
    parse_dates : boolean or list of ints or names or list of lists or dict, default False

        * boolean. If True -> try parsing the index.
        * list of ints or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call result
          'foo'

        If a column or index contains an unparseable date, the entire column or
        index will be returned unaltered as an object data type. For non-standard
        datetime parsing, use ``pd.to_datetime`` after ``pd.read_csv``

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : boolean, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : boolean, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, default None
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : boolean, default False
        DD/MM format dates, international and European format
    iterator : boolean, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, default None
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, default None
        Thousands separator
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    float_precision : string, default None
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.
    lineterminator : str (length 1), default None
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : boolean, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), default None
        One-character string used to escape delimiter when quoting is QUOTE_NONE.
    comment : str, default None
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, default None
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_
    dialect : str or csv.Dialect instance, default None
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    tupleize_cols : boolean, default False
        .. deprecated:: 0.21.0
           This argument will be removed and will always convert to MultiIndex

        Leave a list of tuples on columns as is (default is to convert to
        a MultiIndex on the columns)
    error_bad_lines : boolean, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : boolean, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    low_memory : boolean, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser)
    memory_map : boolean, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.

    Returns
    -------
    result : DataFrame or TextParser

In [31]:
df = pd.read_csv('marks.csv',\
            names=['Student Name','Maths','Science','English'])

In [32]:
df

  Student Name  Maths  Science  English
0        'Ram'     23     57.0       35
1       'Asha'     45      NaN       66
2       'Roja'     56     55.0       45
3       'Ravi'     77     89.0       67
4       'Suma'     90     56.0       37
5      'Rohan'     67     82.0       29
6      'Raman'     39     78.0       34
7      'Basha'     65     34.0       78
8  'Charishma'     56     78.0       34
9      'Krish'     72     34.0       78

In [33]:
df['Student Name']

0          'Ram'
1         'Asha'
2         'Roja'
3         'Ravi'
4         'Suma'
5        'Rohan'
6        'Raman'
7        'Basha'
8    'Charishma'
9        'Krish'
Name: Student Name, dtype: object

In [34]:
df.columns

Index(['Student Name', 'Maths', 'Science', 'English'], dtype='object')

In [35]:
df[['Student Name']]

  Student Name
0        'Ram'
1       'Asha'
2       'Roja'
3       'Ravi'
4       'Suma'
5      'Rohan'
6      'Raman'
7      'Basha'
8  'Charishma'
9      'Krish'

In [36]:
df[['Student Name','Maths']]

  Student Name  Maths
0        'Ram'     23
1       'Asha'     45
2       'Roja'     56
3       'Ravi'     77
4       'Suma'     90
5      'Rohan'     67
6      'Raman'     39
7      'Basha'     65
8  'Charishma'     56
9      'Krish'     72

In [37]:
df.values

array([["'Ram'", 23, 57.0, 35],
       ["'Asha'", 45, nan, 66],
       ["'Roja'", 56, 55.0, 45],
       ["'Ravi'", 77, 89.0, 67],
       ["'Suma'", 90, 56.0, 37],
       ["'Rohan'", 67, 82.0, 29],
       ["'Raman'", 39, 78.0, 34],
       ["'Basha'", 65, 34.0, 78],
       ["'Charishma'", 56, 78.0, 34],
       ["'Krish'", 72, 34.0, 78]], dtype=object)

In [38]:
df.columns # To get the column names

Index(['Student Name', 'Maths', 'Science', 'English'], dtype='object')

In [39]:
df.dtypes # Datatype of ecah columns

Student Name     object
Maths             int64
Science         float64
English           int64
dtype: object

In [40]:
df.index # Row indices

RangeIndex(start=0, stop=10, step=1)

In [41]:
df.shape # tuple of no of rows and columns

(10, 4)

In [42]:
# no of rows
print(df.shape[0])
# no of columns 
print(df.shape[1])

10
4

In [43]:
print(df)

  Student Name  Maths  Science  English
0        'Ram'     23     57.0       35
1       'Asha'     45      NaN       66
2       'Roja'     56     55.0       45
3       'Ravi'     77     89.0       67
4       'Suma'     90     56.0       37
5      'Rohan'     67     82.0       29
6      'Raman'     39     78.0       34
7      'Basha'     65     34.0       78
8  'Charishma'     56     78.0       34
9      'Krish'     72     34.0       78

Indexing
- Position based Indexing (iloc)
- Label Based Indexing(loc)

In [44]:
df

  Student Name  Maths  Science  English
0        'Ram'     23     57.0       35
1       'Asha'     45      NaN       66
2       'Roja'     56     55.0       45
3       'Ravi'     77     89.0       67
4       'Suma'     90     56.0       37
5      'Rohan'     67     82.0       29
6      'Raman'     39     78.0       34
7      'Basha'     65     34.0       78
8  'Charishma'     56     78.0       34
9      'Krish'     72     34.0       78

#### df.iloc

In [45]:
df.iloc[4,0:2]

Student Name    'Suma'
Maths               90
Name: 4, dtype: object

In [46]:
df.iloc[4:6,:]

  Student Name  Maths  Science  English
4       'Suma'     90     56.0       37
5      'Rohan'     67     82.0       29

In [47]:
df.iloc[2,3]

45

In [48]:
df.iloc[2,:] # df.iloc[2],df.iloc[2,]

Student Name    'Roja'
Maths               56
Science             55
English             45
Name: 2, dtype: object

In [49]:
df.iloc[:,1]

0    23
1    45
2    56
3    77
4    90
5    67
6    39
7    65
8    56
9    72
Name: Maths, dtype: int64

In [50]:
df.iloc[[1,3,6],[2,0,1]]

   Science Student Name  Maths
1      NaN       'Asha'     45
3     89.0       'Ravi'     77
6     78.0      'Raman'     39

#### loc

In [51]:
df.loc[0,'Student Name']

"'Ram'"

In [52]:
df.loc[2:4,'Student Name']

2    'Roja'
3    'Ravi'
4    'Suma'
Name: Student Name, dtype: object

In [53]:
df.loc[2:4,'Student Name':'Science']

  Student Name  Maths  Science
2       'Roja'     56     55.0
3       'Ravi'     77     89.0
4       'Suma'     90     56.0

In [54]:
df.loc[2:4,['Science','Student Name']]

   Science Student Name
2     55.0       'Roja'
3     89.0       'Ravi'
4     56.0       'Suma'

In [55]:
df[['Student Name','Science','Maths','English']]

  Student Name  Science  Maths  English
0        'Ram'     57.0     23       35
1       'Asha'      NaN     45       66
2       'Roja'     55.0     56       45
3       'Ravi'     89.0     77       67
4       'Suma'     56.0     90       37
5      'Rohan'     82.0     67       29
6      'Raman'     78.0     39       34
7      'Basha'     34.0     65       78
8  'Charishma'     78.0     56       34
9      'Krish'     34.0     72       78

In [56]:
df1 = df.set_index('Student Name')
df1

              Maths  Science  English
Student Name
'Ram'            23     57.0       35
'Asha'           45      NaN       66
'Roja'           56     55.0       45
'Ravi'           77     89.0       67
'Suma'           90     56.0       37
'Rohan'          67     82.0       29
'Raman'          39     78.0       34
'Basha'          65     34.0       78
'Charishma'      56     78.0       34
'Krish'          72     34.0       78

In [57]:
df1.loc["'Ram'",'Maths']

23

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Student Name    10 non-null object
Maths           10 non-null int64
Science         9 non-null float64
English         10 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 400.0+ bytes

In [59]:
df['Total'] = df['English']+df['Maths']+df['Science']
df

  Student Name  Maths  Science  English  Total
0        'Ram'     23     57.0       35  115.0
1       'Asha'     45      NaN       66    NaN
2       'Roja'     56     55.0       45  156.0
3       'Ravi'     77     89.0       67  233.0
4       'Suma'     90     56.0       37  183.0
5      'Rohan'     67     82.0       29  178.0
6      'Raman'     39     78.0       34  151.0
7      'Basha'     65     34.0       78  177.0
8  'Charishma'     56     78.0       34  168.0
9      'Krish'     72     34.0       78  184.0

In [60]:
df.sum()

Student Name    'Ram''Asha''Roja''Ravi''Suma''Rohan''Raman''Ba...
Maths                                                         590
Science                                                       563
English                                                       503
Total                                                        1545
dtype: object

In [61]:
df.iloc[:,1:4].sum(axis=1)

0    115.0
1    111.0
2    156.0
3    233.0
4    183.0
5    178.0
6    151.0
7    177.0
8    168.0
9    184.0
dtype: float64

In [62]:
df

  Student Name  Maths  Science  English  Total
0        'Ram'     23     57.0       35  115.0
1       'Asha'     45      NaN       66    NaN
2       'Roja'     56     55.0       45  156.0
3       'Ravi'     77     89.0       67  233.0
4       'Suma'     90     56.0       37  183.0
5      'Rohan'     67     82.0       29  178.0
6      'Raman'     39     78.0       34  151.0
7      'Basha'     65     34.0       78  177.0
8  'Charishma'     56     78.0       34  168.0
9      'Krish'     72     34.0       78  184.0

In [63]:
df.describe()

           Maths    Science    English       Total
count  10.000000   9.000000  10.000000    9.000000
mean   59.000000  62.555556  50.300000  171.666667
std    19.618585  20.359955  19.675422   31.638584
min    23.000000  34.000000  29.000000  115.000000
25%    47.750000  55.000000  34.250000  156.000000
50%    60.500000  57.000000  41.000000  177.000000
75%    70.750000  78.000000  66.750000  183.000000
max    90.000000  89.000000  78.000000  233.000000

In [64]:
df.describe(include=object)

       Student Name
count            10
unique           10
top         'Krish'
freq              1

In [65]:
df.describe(include=np.int64)

           Maths    English
count  10.000000  10.000000
mean   59.000000  50.300000
std    19.618585  19.675422
min    23.000000  29.000000
25%    47.750000  34.250000
50%    60.500000  41.000000
75%    70.750000  66.750000
max    90.000000  78.000000

In [66]:
student_df = pd.read_csv('student.csv',\
                    names = ['Student Name','College','Course'])
student_df

  Student Name College            Course
0       'Asha'    IIIT  Machine Learning
1       'Roja'    SVCE            Python
2       'Ravi'    SRKR      Data Science
3       'Suma'    SRKR      Data Science
4        'Ram'    IIIT      Data Science
5       'Guru'    IIIT  Machine Learning
6      'Kumar'    SVEC      Data Science

Check the
- head
- tail
- sample
- shape
- columns
- dtpyes
- index
- info
- describe

In [67]:
student_df.head(2) # First Rows

  Student Name College            Course
0       'Asha'    IIIT  Machine Learning
1       'Roja'    SVCE            Python

In [68]:
student_df.tail(2) # Last rows

  Student Name College            Course
5       'Guru'    IIIT  Machine Learning
6      'Kumar'    SVEC      Data Science

In [69]:
student_df.sample(3) # random selection

  Student Name College            Course
5       'Guru'    IIIT  Machine Learning
2       'Ravi'    SRKR      Data Science
3       'Suma'    SRKR      Data Science

In [70]:
student_df.shape

(7, 3)

In [71]:
student_df.columns

Index(['Student Name', 'College', 'Course'], dtype='object')

In [72]:
student_df.dtypes

Student Name    object
College         object
Course          object
dtype: object

In [73]:
student_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Student Name    7 non-null object
College         7 non-null object
Course          7 non-null object
dtypes: object(3)
memory usage: 248.0+ bytes

In [74]:
student_df.describe()

       Student Name College        Course
count             7       7             7
unique            7       4             3
top          'Roja'    IIIT  Data Science
freq              1       3             4

In [75]:
student_df.nunique()

Student Name    7
College         4
Course          3
dtype: int64

In [76]:
student_df.College.nunique()

4

In [77]:
student_df.College.value_counts()

IIIT    3
SRKR    2
SVEC    1
SVCE    1
Name: College, dtype: int64

#### pd.merge

In [78]:
pd.merge(df,student_df,on='Student Name',how='inner')

  Student Name  Maths  Science  English  Total College            Course
0        'Ram'     23     57.0       35  115.0    IIIT      Data Science
1       'Asha'     45      NaN       66    NaN    IIIT  Machine Learning
2       'Roja'     56     55.0       45  156.0    SVCE            Python
3       'Ravi'     77     89.0       67  233.0    SRKR      Data Science
4       'Suma'     90     56.0       37  183.0    SRKR      Data Science

In [79]:
pd.merge(df,student_df,on='Student Name',how='outer')

   Student Name  Maths  Science  English  Total College            Course
0         'Ram'   23.0     57.0     35.0  115.0    IIIT      Data Science
1        'Asha'   45.0      NaN     66.0    NaN    IIIT  Machine Learning
2        'Roja'   56.0     55.0     45.0  156.0    SVCE            Python
3        'Ravi'   77.0     89.0     67.0  233.0    SRKR      Data Science
4        'Suma'   90.0     56.0     37.0  183.0    SRKR      Data Science
5       'Rohan'   67.0     82.0     29.0  178.0     NaN               NaN
6       'Raman'   39.0     78.0     34.0  151.0     NaN               NaN
7       'Basha'   65.0     34.0     78.0  177.0     NaN               NaN
8   'Charishma'   56.0     78.0     34.0  168.0     NaN               NaN
9       'Krish'   72.0     34.0     78.0  184.0     NaN               NaN
10       'Guru'    NaN      NaN      NaN    NaN    IIIT  Machine Learning
11      'Kumar'    NaN      NaN      NaN    NaN    SVEC      Data Science

In [80]:
pd.merge(df,student_df,on='Student Name',how='left')

  Student Name  Maths  Science  English  Total College            Course
0        'Ram'     23     57.0       35  115.0    IIIT      Data Science
1       'Asha'     45      NaN       66    NaN    IIIT  Machine Learning
2       'Roja'     56     55.0       45  156.0    SVCE            Python
3       'Ravi'     77     89.0       67  233.0    SRKR      Data Science
4       'Suma'     90     56.0       37  183.0    SRKR      Data Science
5      'Rohan'     67     82.0       29  178.0     NaN               NaN
6      'Raman'     39     78.0       34  151.0     NaN               NaN
7      'Basha'     65     34.0       78  177.0     NaN               NaN
8  'Charishma'     56     78.0       34  168.0     NaN               NaN
9      'Krish'     72     34.0       78  184.0     NaN               NaN

In [81]:
pd.merge(df,student_df,on='Student Name',how='right')

  Student Name  Maths  Science  English  Total College            Course
0        'Ram'   23.0     57.0     35.0  115.0    IIIT      Data Science
1       'Asha'   45.0      NaN     66.0    NaN    IIIT  Machine Learning
2       'Roja'   56.0     55.0     45.0  156.0    SVCE            Python
3       'Ravi'   77.0     89.0     67.0  233.0    SRKR      Data Science
4       'Suma'   90.0     56.0     37.0  183.0    SRKR      Data Science
5       'Guru'    NaN      NaN      NaN    NaN    IIIT  Machine Learning
6      'Kumar'    NaN      NaN      NaN    NaN    SVEC      Data Science

Boolean or Fancy Indexing

In [82]:
df['Maths']>60

0    False
1    False
2    False
3     True
4     True
5     True
6    False
7     True
8    False
9     True
Name: Maths, dtype: bool

In [83]:
df[df['Maths']>60]

  Student Name  Maths  Science  English  Total
3       'Ravi'     77     89.0       67  233.0
4       'Suma'     90     56.0       37  183.0
5      'Rohan'     67     82.0       29  178.0
7      'Basha'     65     34.0       78  177.0
9      'Krish'     72     34.0       78  184.0

In [84]:
df[(df['Maths']>60) & (df['Maths']<80) ]

  Student Name  Maths  Science  English  Total
3       'Ravi'     77     89.0       67  233.0
5      'Rohan'     67     82.0       29  178.0
7      'Basha'     65     34.0       78  177.0
9      'Krish'     72     34.0       78  184.0

In [85]:
df[(df['Maths']>60) & (df['English']>50) ]

  Student Name  Maths  Science  English  Total
3       'Ravi'     77     89.0       67  233.0
7      'Basha'     65     34.0       78  177.0
9      'Krish'     72     34.0       78  184.0

In [86]:
df[(df['Maths']>60) & (df['English']>50) ]['Science']

3    89.0
7    34.0
9    34.0
Name: Science, dtype: float64

In [87]:
df['Science'][(df['Maths']>60) & (df['English']>50)]

3    89.0
7    34.0
9    34.0
Name: Science, dtype: float64

In [88]:
student_df['Course']=='Machine Learning'

0     True
1    False
2    False
3    False
4    False
5     True
6    False
Name: Course, dtype: bool

In [89]:
student_df[student_df['Course']=='Machine Learning']

  Student Name College            Course
0       'Asha'    IIIT  Machine Learning
5       'Guru'    IIIT  Machine Learning

In [90]:
student_df[student_df['College']=='IIIT']

  Student Name College            Course
0       'Asha'    IIIT  Machine Learning
4        'Ram'    IIIT      Data Science
5       'Guru'    IIIT  Machine Learning

Sorting

In [91]:
df.sort_values('Maths')

  Student Name  Maths  Science  English  Total
0        'Ram'     23     57.0       35  115.0
6      'Raman'     39     78.0       34  151.0
1       'Asha'     45      NaN       66    NaN
2       'Roja'     56     55.0       45  156.0
8  'Charishma'     56     78.0       34  168.0
7      'Basha'     65     34.0       78  177.0
5      'Rohan'     67     82.0       29  178.0
9      'Krish'     72     34.0       78  184.0
3       'Ravi'     77     89.0       67  233.0
4       'Suma'     90     56.0       37  183.0

In [92]:
df.sort_values('Maths',ascending=False)

  Student Name  Maths  Science  English  Total
4       'Suma'     90     56.0       37  183.0
3       'Ravi'     77     89.0       67  233.0
9      'Krish'     72     34.0       78  184.0
5      'Rohan'     67     82.0       29  178.0
7      'Basha'     65     34.0       78  177.0
2       'Roja'     56     55.0       45  156.0
8  'Charishma'     56     78.0       34  168.0
1       'Asha'     45      NaN       66    NaN
6      'Raman'     39     78.0       34  151.0
0        'Ram'     23     57.0       35  115.0

In [93]:
df.sort_values('Total',ascending=False)

  Student Name  Maths  Science  English  Total
3       'Ravi'     77     89.0       67  233.0
9      'Krish'     72     34.0       78  184.0
4       'Suma'     90     56.0       37  183.0
5      'Rohan'     67     82.0       29  178.0
7      'Basha'     65     34.0       78  177.0
8  'Charishma'     56     78.0       34  168.0
2       'Roja'     56     55.0       45  156.0
6      'Raman'     39     78.0       34  151.0
0        'Ram'     23     57.0       35  115.0
1       'Asha'     45      NaN       66    NaN

In [94]:
df.sort_values('Student Name')

  Student Name  Maths  Science  English  Total
1       'Asha'     45      NaN       66    NaN
7      'Basha'     65     34.0       78  177.0
8  'Charishma'     56     78.0       34  168.0
9      'Krish'     72     34.0       78  184.0
0        'Ram'     23     57.0       35  115.0
6      'Raman'     39     78.0       34  151.0
3       'Ravi'     77     89.0       67  233.0
5      'Rohan'     67     82.0       29  178.0
2       'Roja'     56     55.0       45  156.0
4       'Suma'     90     56.0       37  183.0

In [95]:
df1

              Maths  Science  English
Student Name
'Ram'            23     57.0       35
'Asha'           45      NaN       66
'Roja'           56     55.0       45
'Ravi'           77     89.0       67
'Suma'           90     56.0       37
'Rohan'          67     82.0       29
'Raman'          39     78.0       34
'Basha'          65     34.0       78
'Charishma'      56     78.0       34
'Krish'          72     34.0       78

In [96]:
df1.sort_index()

              Maths  Science  English
Student Name
'Asha'           45      NaN       66
'Basha'          65     34.0       78
'Charishma'      56     78.0       34
'Krish'          72     34.0       78
'Ram'            23     57.0       35
'Raman'          39     78.0       34
'Ravi'           77     89.0       67
'Rohan'          67     82.0       29
'Roja'           56     55.0       45
'Suma'           90     56.0       37

Misisng values

In [97]:
df.isnull()

   Student Name  Maths  Science  English  Total
0         False  False    False    False  False
1         False  False     True    False   True
2         False  False    False    False  False
3         False  False    False    False  False
4         False  False    False    False  False
5         False  False    False    False  False
6         False  False    False    False  False
7         False  False    False    False  False
8         False  False    False    False  False
9         False  False    False    False  False

In [98]:
df.isna()

   Student Name  Maths  Science  English  Total
0         False  False    False    False  False
1         False  False     True    False   True
2         False  False    False    False  False
3         False  False    False    False  False
4         False  False    False    False  False
5         False  False    False    False  False
6         False  False    False    False  False
7         False  False    False    False  False
8         False  False    False    False  False
9         False  False    False    False  False

In [99]:
df.isnull().sum()

Student Name    0
Maths           0
Science         1
English         0
Total           1
dtype: int64

In [100]:
print(df.Science.min(),df.Science.max())
print(df.Science.mean())
print(df.Science.median())
print(df.Science.mode())

34.0 89.0
62.55555555555556
57.0
0    34.0
1    78.0
dtype: float64

In [101]:
df.Science.value_counts()

34.0    2
78.0    2
82.0    1
56.0    1
89.0    1
55.0    1
57.0    1
Name: Science, dtype: int64

In [102]:
df['Science'].fillna(df['Science'].mean(),inplace=True)

In [103]:
df

  Student Name  Maths    Science  English  Total
0        'Ram'     23  57.000000       35  115.0
1       'Asha'     45  62.555556       66    NaN
2       'Roja'     56  55.000000       45  156.0
3       'Ravi'     77  89.000000       67  233.0
4       'Suma'     90  56.000000       37  183.0
5      'Rohan'     67  82.000000       29  178.0
6      'Raman'     39  78.000000       34  151.0
7      'Basha'     65  34.000000       78  177.0
8  'Charishma'     56  78.000000       34  168.0
9      'Krish'     72  34.000000       78  184.0

In [104]:
df2 = pd.read_csv('marks.csv',\
            names=['Student Name','Maths','Science','English'])

In [105]:
df2

  Student Name  Maths  Science  English
0        'Ram'     23     57.0       35
1       'Asha'     45      NaN       66
2       'Roja'     56     55.0       45
3       'Ravi'     77     89.0       67
4       'Suma'     90     56.0       37
5      'Rohan'     67     82.0       29
6      'Raman'     39     78.0       34
7      'Basha'     65     34.0       78
8  'Charishma'     56     78.0       34
9      'Krish'     72     34.0       78

In [106]:
df2.dropna()

  Student Name  Maths  Science  English
0        'Ram'     23     57.0       35
2       'Roja'     56     55.0       45
3       'Ravi'     77     89.0       67
4       'Suma'     90     56.0       37
5      'Rohan'     67     82.0       29
6      'Raman'     39     78.0       34
7      'Basha'     65     34.0       78
8  'Charishma'     56     78.0       34
9      'Krish'     72     34.0       78

In [107]:
df2.dropna(axis=1)

  Student Name  Maths  English
0        'Ram'     23       35
1       'Asha'     45       66
2       'Roja'     56       45
3       'Ravi'     77       67
4       'Suma'     90       37
5      'Rohan'     67       29
6      'Raman'     39       34
7      'Basha'     65       78
8  'Charishma'     56       34
9      'Krish'     72       78

In [108]:
df2.drop('Maths',axis=1)

  Student Name  Science  English
0        'Ram'     57.0       35
1       'Asha'      NaN       66
2       'Roja'     55.0       45
3       'Ravi'     89.0       67
4       'Suma'     56.0       37
5      'Rohan'     82.0       29
6      'Raman'     78.0       34
7      'Basha'     34.0       78
8  'Charishma'     78.0       34
9      'Krish'     34.0       78

In [109]:
df1

              Maths  Science  English
Student Name
'Ram'            23     57.0       35
'Asha'           45      NaN       66
'Roja'           56     55.0       45
'Ravi'           77     89.0       67
'Suma'           90     56.0       37
'Rohan'          67     82.0       29
'Raman'          39     78.0       34
'Basha'          65     34.0       78
'Charishma'      56     78.0       34
'Krish'          72     34.0       78

In [110]:
df1.drop("'Ram'")

              Maths  Science  English
Student Name
'Asha'           45      NaN       66
'Roja'           56     55.0       45
'Ravi'           77     89.0       67
'Suma'           90     56.0       37
'Rohan'          67     82.0       29
'Raman'          39     78.0       34
'Basha'          65     34.0       78
'Charishma'      56     78.0       34
'Krish'          72     34.0       78

In [111]:
final_df = pd.merge(df,student_df,how='outer')
final_df

   Student Name  Maths    Science  English  Total College            Course
0         'Ram'   23.0  57.000000     35.0  115.0    IIIT      Data Science
1        'Asha'   45.0  62.555556     66.0    NaN    IIIT  Machine Learning
2        'Roja'   56.0  55.000000     45.0  156.0    SVCE            Python
3        'Ravi'   77.0  89.000000     67.0  233.0    SRKR      Data Science
4        'Suma'   90.0  56.000000     37.0  183.0    SRKR      Data Science
5       'Rohan'   67.0  82.000000     29.0  178.0     NaN               NaN
6       'Raman'   39.0  78.000000     34.0  151.0     NaN               NaN
7       'Basha'   65.0  34.000000     78.0  177.0     NaN               NaN
8   'Charishma'   56.0  78.000000     34.0  168.0     NaN               NaN
9       'Krish'   72.0  34.000000     78.0  184.0     NaN               NaN
10       'Guru'    NaN        NaN      NaN    NaN    IIIT  Machine Learning
11      'Kumar'    NaN        NaN      NaN    NaN    SVEC      Data Science

In [112]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 7 columns):
Student Name    12 non-null object
Maths           10 non-null float64
Science         10 non-null float64
English         10 non-null float64
Total           9 non-null float64
College         7 non-null object
Course          7 non-null object
dtypes: float64(4), object(3)
memory usage: 768.0+ bytes

In [113]:
final_df.isnull()

    Student Name  Maths  Science  English  Total  College  Course
0          False  False    False    False  False    False   False
1          False  False    False    False   True    False   False
2          False  False    False    False  False    False   False
3          False  False    False    False  False    False   False
4          False  False    False    False  False    False   False
5          False  False    False    False  False     True    True
6          False  False    False    False  False     True    True
7          False  False    False    False  False     True    True
8          False  False    False    False  False     True    True
9          False  False    False    False  False     True    True
10         False   True     True     True   True    False   False
11         False   True     True     True   True    False   False

In [114]:
final_df.isnull().sum()

Student Name    0
Maths           2
Science         2
English         2
Total           3
College         5
Course          5
dtype: int64

In [115]:
final_df.columns

Index(['Student Name', 'Maths', 'Science', 'English', 'Total', 'College',
       'Course'],
      dtype='object')

In [116]:
final_df.dtypes

Student Name     object
Maths           float64
Science         float64
English         float64
Total           float64
College          object
Course           object
dtype: object

In [117]:
final_df.dtypes != object

Student Name    False
Maths            True
Science          True
English          True
Total            True
College         False
Course          False
dtype: bool

In [118]:
final_df.columns[final_df.dtypes != object]

Index(['Maths', 'Science', 'English', 'Total'], dtype='object')

In [119]:
final_df.describe().columns

Index(['Maths', 'Science', 'English', 'Total'], dtype='object')

In [120]:
final_df.columns[final_df.dtypes == object]

Index(['Student Name', 'College', 'Course'], dtype='object')

In [121]:
final_df.describe(include=object).columns

Index(['Student Name', 'College', 'Course'], dtype='object')

In [122]:
cat_cols = final_df.describe(include=object).columns
num_cols = final_df.columns[final_df.dtypes != object]

In [126]:
print(cat_cols)
print(num_cols)

Index(['Student Name', 'College', 'Course'], dtype='object')
Index(['Maths', 'Science', 'English', 'Total'], dtype='object')

In [129]:
print(final_df.College.mode())

0    IIIT
dtype: object

Numerical Columns

In [131]:
for col in num_cols:
    final_df[col].fillna(final_df[col].mean(),inplace=True)

In [132]:
final_df

,Student Name,Maths,Science,English,Total,College,Course
0,'Ram',23.0,57.000000,35.0,115.000000,IIIT,Data Science
1,'Asha',45.0,62.555556,66.0,171.666667,IIIT,Machine Learning
2,'Roja',56.0,55.000000,45.0,156.000000,SVCE,Python
3,'Ravi',77.0,89.000000,67.0,233.000000,SRKR,Data Science
4,'Suma',90.0,56.000000,37.0,183.000000,SRKR,Data Science
5,'Rohan',67.0,82.000000,29.0,178.000000,NaN,NaN
6,'Raman',39.0,78.000000,34.0,151.000000,NaN,NaN
7,'Basha',65.0,34.000000,78.0,177.000000,NaN,NaN
8,'Charishma',56.0,78.000000,34.0,168.000000,NaN,NaN
9,'Krish',72.0,34.000000,78.0,184.000000,NaN,NaN
10,'Guru',59.0,62.555556,50.3,171.666667,IIIT,Machine Learning
11,'Kumar',59.0,62.555556,50.3,171.666667,SVEC,Data Science

In [144]:
for col in cat_cols:
    final_df[col].fillna(final_df[col].mode()[0],inplace=True)

In [142]:
final_df['College'][final_df['College'].isna()]

5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
Name: College, dtype: object

In [143]:
final_df['College'].mode()[0]

'IIIT'

In [145]:
final_df

,Student Name,Maths,Science,English,Total,College,Course
0,'Ram',23.0,57.000000,35.0,115.000000,IIIT,Data Science
1,'Asha',45.0,62.555556,66.0,171.666667,IIIT,Machine Learning
2,'Roja',56.0,55.000000,45.0,156.000000,SVCE,Python
3,'Ravi',77.0,89.000000,67.0,233.000000,SRKR,Data Science
4,'Suma',90.0,56.000000,37.0,183.000000,SRKR,Data Science
5,'Rohan',67.0,82.000000,29.0,178.000000,IIIT,Data Science
6,'Raman',39.0,78.000000,34.0,151.000000,IIIT,Data Science
7,'Basha',65.0,34.000000,78.0,177.000000,IIIT,Data Science
8,'Charishma',56.0,78.000000,34.0,168.000000,IIIT,Data Science
9,'Krish',72.0,34.000000,78.0,184.000000,IIIT,Data Science
10,'Guru',59.0,62.555556,50.3,171.666667,IIIT,Machine Learning
11,'Kumar',59.0,62.555556,50.3,171.666667,SVEC,Data Science

#### Grouping

In [148]:
final_df.groupby('College')['Maths'].max()

College
IIIT    72.0
SRKR    90.0
SVCE    56.0
SVEC    59.0
Name: Maths, dtype: float64

In [149]:
final_df.groupby('College').Maths.sum()

College
IIIT    426.0
SRKR    167.0
SVCE     56.0
SVEC     59.0
Name: Maths, dtype: float64

In [151]:
final_df.groupby('College')[['Maths','Science']].max()

         Maths    Science
College
IIIT      72.0  82.000000
SRKR      90.0  89.000000
SVCE      56.0  55.000000
SVEC      59.0  62.555556

In [150]:
final_df.groupby('College').sum()

         Maths     Science  English        Total
College
IIIT     426.0  488.111111    404.3  1316.333333
SRKR     167.0  145.000000    104.0   416.000000
SVCE      56.0   55.000000     45.0   156.000000
SVEC      59.0   62.555556     50.3   171.666667

In [152]:
final_df.groupby('Course').Maths.max()

Course
Data Science        90.0
Machine Learning    59.0
Python              56.0
Name: Maths, dtype: float64

In [156]:
final_df.groupby(['Course','College']).Maths.max()

Course            College
Data Science      IIIT       72.0
                  SRKR       90.0
                  SVEC       59.0
Machine Learning  IIIT       59.0
Python            SVCE       56.0
Name: Maths, dtype: float64